ДО_для_разработки/src/Catalogs/ПапкиФорума/ПапкиФорума.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПапкиФорума</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ТемыДокументов</name>
      <description>Предметные темы</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <comment>Описание раздела</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за раздел</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата создания раздела</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

ДО_для_разработки/src/Catalogs/ПапкиФорума/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ДатаСоздания = ТекущаяДатаСеанса();
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Предопределенный Тогда
		
		// Проверка установки пометки удаления для предопределенного элемента
		Если Предопределенный И ПометкаУдаления Тогда
			ОписаниеОшибки = НСтр("ru = 'Пометка на удаление предопределенного элемента справочника запрещена'");
			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;
		
		// Проверка переноса предопределенного элемента
		Если ЗначениеЗаполнено(Родитель) Тогда
			ОписаниеОшибки = НСтр("ru = 'Перенос предопределенного раздела запрещен'");
			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверка переноса элемента в предопределенный раздел
	Если Родитель = Справочники.ПапкиФорума.ТемыДокументов Тогда
		ОписаниеОшибки = НСтр("ru = 'В предопределенном разделе запрещены подразделы'");
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаСоздания = ТекущаяДатаСеанса();
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти
